{
  "bos_token": "<s>",
  "cls_token": "<graph>",
  "eos_token": "</s>",
  "mask_token": {
    "content": "<mask>",
    "lstrip": true,
    "normalized": true,
    "rstrip": false,
    "single_word": false
  },
  "pad_token": "<pad>",
  "sep_token": "</graph>",
  "unk_token": "<unk>"
}
