{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "WhitespaceSplit"
  },
  "post_processor": {
    "type": "RobertaProcessing",
    "sep": [
      "</graph>",
      2
    ],
    "cls": [
      "<graph>",
      0
    ],
    "trim_offsets": true,
    "add_prefix_space": false
  },
  "decoder": null,
  "model": {
    "type": "WordLevel",
    "vocab": {
      "<graph>": 0,
      "<pad>": 1,
      "</graph>": 2,
      "<unk>": 3,
      "\n-(:)-\n": 4,
      "!-(:)-!": 5,
      "!=-(:)-!=": 6,
      "!==-(:)-!==": 7,
      "\"\"-(:)-\"\"": 8,
      "\"-(:)-\"": 9,
      "\"U8-(:)-\"U8": 10,
      "\"u8-(:)-\"u8": 11,
      "#define-(:)-#define": 12,
      "#elif-(:)-#elif": 13,
      "#else-(:)-#else": 14,
      "#endif-(:)-#endif": 15,
      "#if-(:)-#if": 16,
      "#ifdef-(:)-#ifdef": 17,
      "#ifndef-(:)-#ifndef": 18,
      "#include-(:)-#include": 19,
      "$\"-(:)-$\"": 20,
      "$@\"-(:)-$@\"": 21,
      "${-(:)-${": 22,
      "%-(:)-%": 23,
      "%=-(:)-%=": 24,
      "&&-(:)-&&": 25,
      "&&=-(:)-&&=": 26,
      "&-(:)-&": 27,
      "&=-(:)-&=": 28,
      "'-(:)-'": 29,
      "()-(:)-()": 30,
      "(-(:)-(": 31,
      ")-(:)-)": 32,
      "**-(:)-**": 33,
      "**=-(:)-**=": 34,
      "*-(:)-*": 35,
      "*=-(:)-*=": 36,
      "++-(:)-++": 37,
      "+-(:)-+": 38,
      "+=-(:)-+=": 39,
      ",-(:)-,": 40,
      "--(:)--": 41,
      "---(:)---": 42,
      "-=-(:)--=": 43,
      "->*-(:)-->*": 44,
      "->-(:)-->": 45,
      ".-(:)-.": 46,
      "..-(:)-..": 47,
      "...-(:)-...": 48,
      "/-(:)-/": 49,
      "//-(:)-//": 50,
      "//=-(:)-//=": 51,
      "/=-(:)-/=": 52,
      ":-(:)-:": 53,
      "::-(:)-::": 54,
      ":=-(:)-:=": 55,
      ";-(:)-;": 56,
      "<-(:)-<": 57,
      "<<-(:)-<<": 58,
      "<<=-(:)-<<=": 59,
      "<=-(:)-<=": 60,
      "<>-(:)-<>": 61,
      "=-(:)-=": 62,
      "==-(:)-==": 63,
      "===-(:)-===": 64,
      "=>-(:)-=>": 65,
      ">-(:)->": 66,
      ">=-(:)->=": 67,
      ">>-(:)->>": 68,
      ">>=-(:)->>=": 69,
      ">>>-(:)->>>": 70,
      ">>>=-(:)->>>=": 71,
      "?-(:)-?": 72,
      "?.-(:)-?.": 73,
      "??-(:)-??": 74,
      "??=-(:)-??=": 75,
      "@$\"-(:)-@$\"": 76,
      "@-(:)-@": 77,
      "@=-(:)-@=": 78,
      "@interface-(:)-@interface": 79,
      "Cdecl-(:)-Cdecl": 80,
      "Fastcall-(:)-Fastcall": 81,
      "L\"-(:)-L\"": 82,
      "L'-(:)-L'": 83,
      "Stdcall-(:)-Stdcall": 84,
      "Thiscall-(:)-Thiscall": 85,
      "U\"-(:)-U\"": 86,
      "U'-(:)-U'": 87,
      "[-(:)-[": 88,
      "[[-(:)-[[": 89,
      "[]-(:)-[]": 90,
      "]-(:)-]": 91,
      "]]-(:)-]]": 92,
      "^-(:)-^": 93,
      "^=-(:)-^=": 94,
      "_Atomic-(:)-_Atomic": 95,
      "__attribute__-(:)-__attribute__": 96,
      "__based-(:)-__based": 97,
      "__cdecl-(:)-__cdecl": 98,
      "__clrcall-(:)-__clrcall": 99,
      "__declspec-(:)-__declspec": 100,
      "__fastcall-(:)-__fastcall": 101,
      "__future__-(:)-__future__": 102,
      "__makeref-(:)-__makeref": 103,
      "__reftype-(:)-__reftype": 104,
      "__refvalue-(:)-__refvalue": 105,
      "__stdcall-(:)-__stdcall": 106,
      "__thiscall-(:)-__thiscall": 107,
      "__unaligned-(:)-__unaligned": 108,
      "__vectorcall-(:)-__vectorcall": 109,
      "_unaligned-(:)-_unaligned": 110,
      "`-(:)-`": 111,
      "abstract-(:)-abstract": 112,
      "abstract_array_declarator-(:)-abstract_array_declarator": 113,
      "abstract_array_declarator-(:)-type_qualifier": 114,
      "abstract_function_declarator-(:)-abstract_function_declarator": 115,
      "abstract_function_declarator-(:)-noexcept": 116,
      "abstract_function_declarator-(:)-ref_qualifier": 117,
      "abstract_function_declarator-(:)-throw_specifier": 118,
      "abstract_function_declarator-(:)-trailing_return_type": 119,
      "abstract_function_declarator-(:)-type_qualifier": 120,
      "abstract_parenthesized_declarator-(:)-abstract_array_declarator": 121,
      "abstract_parenthesized_declarator-(:)-abstract_function_declarator": 122,
      "abstract_parenthesized_declarator-(:)-abstract_parenthesized_declarator": 123,
      "abstract_parenthesized_declarator-(:)-abstract_pointer_declarator": 124,
      "abstract_parenthesized_declarator-(:)-abstract_reference_declarator": 125,
      "abstract_pointer_declarator-(:)-abstract_pointer_declarator": 126,
      "abstract_pointer_declarator-(:)-type_qualifier": 127,
      "abstract_reference_declarator-(:)-abstract_array_declarator": 128,
      "abstract_reference_declarator-(:)-abstract_function_declarator": 129,
      "abstract_reference_declarator-(:)-abstract_parenthesized_declarator": 130,
      "abstract_reference_declarator-(:)-abstract_pointer_declarator": 131,
      "abstract_reference_declarator-(:)-abstract_reference_declarator": 132,
      "access_specifier-(:)-access_specifier": 133,
      "accessor_declaration-(:)-accessor_declaration": 134,
      "accessor_declaration-(:)-attribute_list": 135,
      "accessor_declaration-(:)-identifier": 136,
      "accessor_declaration-(:)-modifier": 137,
      "accessor_list-(:)-accessor_declaration": 138,
      "accessor_list-(:)-accessor_list": 139,
      "add-(:)-add": 140,
      "alias-(:)-alias": 141,
      "alias_declaration-(:)-alias_declaration": 142,
      "alias_qualified_name-(:)-generic_name": 143,
      "alias_qualified_name-(:)-global": 144,
      "alias_qualified_name-(:)-identifier": 145,
      "aliased_import-(:)-aliased_import": 146,
      "and-(:)-and": 147,
      "and_pattern-(:)-and_pattern": 148,
      "annotated_type-(:)-annotation": 149,
      "annotated_type-(:)-array_type": 150,
      "annotated_type-(:)-boolean_type": 151,
      "annotated_type-(:)-floating_point_type": 152,
      "annotated_type-(:)-generic_type": 153,
      "annotated_type-(:)-integral_type": 154,
      "annotated_type-(:)-marker_annotation": 155,
      "annotated_type-(:)-scoped_type_identifier": 156,
      "annotated_type-(:)-type_identifier": 157,
      "annotated_type-(:)-void_type": 158,
      "annotation-(:)-annotation": 159,
      "annotation_argument_list-(:)-annotation": 160,
      "annotation_argument_list-(:)-annotation_argument_list": 161,
      "annotation_argument_list-(:)-array_access": 162,
      "annotation_argument_list-(:)-array_creation_expression": 163,
      "annotation_argument_list-(:)-assignment_expression": 164,
      "annotation_argument_list-(:)-binary_expression": 165,
      "annotation_argument_list-(:)-binary_integer_literal": 166,
      "annotation_argument_list-(:)-cast_expression": 167,
      "annotation_argument_list-(:)-character_literal": 168,
      "annotation_argument_list-(:)-class_literal": 169,
      "annotation_argument_list-(:)-decimal_floating_point_literal": 170,
      "annotation_argument_list-(:)-decimal_integer_literal": 171,
      "annotation_argument_list-(:)-element_value_array_initializer": 172,
      "annotation_argument_list-(:)-element_value_pair": 173,
      "annotation_argument_list-(:)-false": 174,
      "annotation_argument_list-(:)-field_access": 175,
      "annotation_argument_list-(:)-hex_floating_point_literal": 176,
      "annotation_argument_list-(:)-hex_integer_literal": 177,
      "annotation_argument_list-(:)-identifier": 178,
      "annotation_argument_list-(:)-instanceof_expression": 179,
      "annotation_argument_list-(:)-lambda_expression": 180,
      "annotation_argument_list-(:)-marker_annotation": 181,
      "annotation_argument_list-(:)-method_invocation": 182,
      "annotation_argument_list-(:)-method_reference": 183,
      "annotation_argument_list-(:)-null_literal": 184,
      "annotation_argument_list-(:)-object_creation_expression": 185,
      "annotation_argument_list-(:)-octal_integer_literal": 186,
      "annotation_argument_list-(:)-parenthesized_expression": 187,
      "annotation_argument_list-(:)-string_literal": 188,
      "annotation_argument_list-(:)-ternary_expression": 189,
      "annotation_argument_list-(:)-this": 190,
      "annotation_argument_list-(:)-true": 191,
      "annotation_argument_list-(:)-unary_expression": 192,
      "annotation_argument_list-(:)-update_expression": 193,
      "annotation_type_body-(:)-annotation_type_body": 194,
      "annotation_type_body-(:)-annotation_type_declaration": 195,
      "annotation_type_body-(:)-annotation_type_element_declaration": 196,
      "annotation_type_body-(:)-class_declaration": 197,
      "annotation_type_body-(:)-constant_declaration": 198,
      "annotation_type_body-(:)-interface_declaration": 199,
      "annotation_type_declaration-(:)-annotation_type_declaration": 200,
      "annotation_type_declaration-(:)-modifiers": 201,
      "annotation_type_element_declaration-(:)-annotation_type_element_declaration": 202,
      "annotation_type_element_declaration-(:)-modifiers": 203,
      "annotations-(:)-annotations": 204,
      "anonymous_method_expression-(:)-block": 205,
      "anonymous_object_creation_expression-(:)-anonymous_method_expression": 206,
      "anonymous_object_creation_expression-(:)-anonymous_object_creation_expression": 207,
      "anonymous_object_creation_expression-(:)-array_creation_expression": 208,
      "anonymous_object_creation_expression-(:)-as_expression": 209,
      "anonymous_object_creation_expression-(:)-assignment_expression": 210,
      "anonymous_object_creation_expression-(:)-await_expression": 211,
      "anonymous_object_creation_expression-(:)-base_expression": 212,
      "anonymous_object_creation_expression-(:)-binary_expression": 213,
      "anonymous_object_creation_expression-(:)-boolean_literal": 214,
      "anonymous_object_creation_expression-(:)-cast_expression": 215,
      "anonymous_object_creation_expression-(:)-character_literal": 216,
      "anonymous_object_creation_expression-(:)-checked_expression": 217,
      "anonymous_object_creation_expression-(:)-conditional_access_expression": 218,
      "anonymous_object_creation_expression-(:)-conditional_expression": 219,
      "anonymous_object_creation_expression-(:)-default_expression": 220,
      "anonymous_object_creation_expression-(:)-element_access_expression": 221,
      "anonymous_object_creation_expression-(:)-element_binding_expression": 222,
      "anonymous_object_creation_expression-(:)-generic_name": 223,
      "anonymous_object_creation_expression-(:)-global": 224,
      "anonymous_object_creation_expression-(:)-identifier": 225,
      "anonymous_object_creation_expression-(:)-implicit_array_creation_expression": 226,
      "anonymous_object_creation_expression-(:)-implicit_object_creation_expression": 227,
      "anonymous_object_creation_expression-(:)-implicit_stack_alloc_array_creation_expression": 228,
      "anonymous_object_creation_expression-(:)-initializer_expression": 229,
      "anonymous_object_creation_expression-(:)-integer_literal": 230,
      "anonymous_object_creation_expression-(:)-interpolated_string_expression": 231,
      "anonymous_object_creation_expression-(:)-invocation_expression": 232,
      "anonymous_object_creation_expression-(:)-is_expression": 233,
      "anonymous_object_creation_expression-(:)-is_pattern_expression": 234,
      "anonymous_object_creation_expression-(:)-lambda_expression": 235,
      "anonymous_object_creation_expression-(:)-make_ref_expression": 236,
      "anonymous_object_creation_expression-(:)-member_access_expression": 237,
      "anonymous_object_creation_expression-(:)-name_equals": 238,
      "anonymous_object_creation_expression-(:)-null_literal": 239,
      "anonymous_object_creation_expression-(:)-object_creation_expression": 240,
      "anonymous_object_creation_expression-(:)-parenthesized_expression": 241,
      "anonymous_object_creation_expression-(:)-postfix_unary_expression": 242,
      "anonymous_object_creation_expression-(:)-prefix_unary_expression": 243,
      "anonymous_object_creation_expression-(:)-query_expression": 244,
      "anonymous_object_creation_expression-(:)-range_expression": 245,
      "anonymous_object_creation_expression-(:)-real_literal": 246,
      "anonymous_object_creation_expression-(:)-ref_expression": 247,
      "anonymous_object_creation_expression-(:)-ref_type_expression": 248,
      "anonymous_object_creation_expression-(:)-ref_value_expression": 249,
      "anonymous_object_creation_expression-(:)-size_of_expression": 250,
      "anonymous_object_creation_expression-(:)-stack_alloc_array_creation_expression": 251,
      "anonymous_object_creation_expression-(:)-string_literal": 252,
      "anonymous_object_creation_expression-(:)-switch_expression": 253,
      "anonymous_object_creation_expression-(:)-this_expression": 254,
      "anonymous_object_creation_expression-(:)-throw_expression": 255,
      "anonymous_object_creation_expression-(:)-tuple_expression": 256,
      "anonymous_object_creation_expression-(:)-type_of_expression": 257,
      "anonymous_object_creation_expression-(:)-verbatim_string_literal": 258,
      "anonymous_object_creation_expression-(:)-with_expression": 259,
      "argument-(:)-anonymous_method_expression": 260,
      "argument-(:)-anonymous_object_creation_expression": 261,
      "argument-(:)-array_creation_expression": 262,
      "argument-(:)-as_expression": 263,
      "argument-(:)-assignment_expression": 264,
      "argument-(:)-await_expression": 265,
      "argument-(:)-base_expression": 266,
      "argument-(:)-binary_expression": 267,
      "argument-(:)-boolean_literal": 268,
      "argument-(:)-cast_expression": 269,
      "argument-(:)-character_literal": 270,
      "argument-(:)-checked_expression": 271,
      "argument-(:)-conditional_access_expression": 272,
      "argument-(:)-conditional_expression": 273,
      "argument-(:)-declaration_expression": 274,
      "argument-(:)-default_expression": 275,
      "argument-(:)-element_access_expression": 276,
      "argument-(:)-element_binding_expression": 277,
      "argument-(:)-generic_name": 278,
      "argument-(:)-global": 279,
      "argument-(:)-identifier": 280,
      "argument-(:)-implicit_array_creation_expression": 281,
      "argument-(:)-implicit_object_creation_expression": 282,
      "argument-(:)-implicit_stack_alloc_array_creation_expression": 283,
      "argument-(:)-initializer_expression": 284,
      "argument-(:)-integer_literal": 285,
      "argument-(:)-interpolated_string_expression": 286,
      "argument-(:)-invocation_expression": 287,
      "argument-(:)-is_expression": 288,
      "argument-(:)-is_pattern_expression": 289,
      "argument-(:)-lambda_expression": 290,
      "argument-(:)-make_ref_expression": 291,
      "argument-(:)-member_access_expression": 292,
      "argument-(:)-name_colon": 293,
      "argument-(:)-null_literal": 294,
      "argument-(:)-object_creation_expression": 295,
      "argument-(:)-parenthesized_expression": 296,
      "argument-(:)-postfix_unary_expression": 297,
      "argument-(:)-prefix_unary_expression": 298,
      "argument-(:)-query_expression": 299,
      "argument-(:)-range_expression": 300,
      "argument-(:)-real_literal": 301,
      "argument-(:)-ref_expression": 302,
      "argument-(:)-ref_type_expression": 303,
      "argument-(:)-ref_value_expression": 304,
      "argument-(:)-size_of_expression": 305,
      "argument-(:)-stack_alloc_array_creation_expression": 306,
      "argument-(:)-string_literal": 307,
      "argument-(:)-switch_expression": 308,
      "argument-(:)-this_expression": 309,
      "argument-(:)-throw_expression": 310,
      "argument-(:)-tuple_expression": 311,
      "argument-(:)-type_of_expression": 312,
      "argument-(:)-verbatim_string_literal": 313,
      "argument-(:)-with_expression": 314,
      "argument_list-(:)-argument": 315,
      "argument_list-(:)-argument_list": 316,
      "argument_list-(:)-array_access": 317,
      "argument_list-(:)-array_creation_expression": 318,
      "argument_list-(:)-as_pattern": 319,
      "argument_list-(:)-assignment_expression": 320,
      "argument_list-(:)-attribute": 321,
      "argument_list-(:)-await": 322,
      "argument_list-(:)-binary_expression": 323,
      "argument_list-(:)-binary_integer_literal": 324,
      "argument_list-(:)-binary_operator": 325,
      "argument_list-(:)-boolean_operator": 326,
      "argument_list-(:)-call": 327,
      "argument_list-(:)-call_expression": 328,
      "argument_list-(:)-cast_expression": 329,
      "argument_list-(:)-char_literal": 330,
      "argument_list-(:)-character_literal": 331,
      "argument_list-(:)-class_literal": 332,
      "argument_list-(:)-co_await_expression": 333,
      "argument_list-(:)-comparison_operator": 334,
      "argument_list-(:)-compound_literal_expression": 335,
      "argument_list-(:)-concatenated_string": 336,
      "argument_list-(:)-conditional_expression": 337,
      "argument_list-(:)-decimal_floating_point_literal": 338,
      "argument_list-(:)-decimal_integer_literal": 339,
      "argument_list-(:)-delete_expression": 340,
      "argument_list-(:)-dictionary": 341,
      "argument_list-(:)-dictionary_comprehension": 342,
      "argument_list-(:)-dictionary_splat": 343,
      "argument_list-(:)-ellipsis": 344,
      "argument_list-(:)-false": 345,
      "argument_list-(:)-field_access": 346,
      "argument_list-(:)-field_expression": 347,
      "argument_list-(:)-float": 348,
      "argument_list-(:)-generator_expression": 349,
      "argument_list-(:)-hex_floating_point_literal": 350,
      "argument_list-(:)-hex_integer_literal": 351,
      "argument_list-(:)-identifier": 352,
      "argument_list-(:)-initializer_list": 353,
      "argument_list-(:)-instanceof_expression": 354,
      "argument_list-(:)-integer": 355,
      "argument_list-(:)-keyword_argument": 356,
      "argument_list-(:)-lambda": 357,
      "argument_list-(:)-lambda_expression": 358,
      "argument_list-(:)-list": 359,
      "argument_list-(:)-list_comprehension": 360,
      "argument_list-(:)-list_splat": 361,
      "argument_list-(:)-method_invocation": 362,
      "argument_list-(:)-method_reference": 363,
      "argument_list-(:)-named_expression": 364,
      "argument_list-(:)-new_expression": 365,
      "argument_list-(:)-none": 366,
      "argument_list-(:)-not_operator": 367,
      "argument_list-(:)-null": 368,
      "argument_list-(:)-null_literal": 369,
      "argument_list-(:)-nullptr": 370,
      "argument_list-(:)-number_literal": 371,
      "argument_list-(:)-object_creation_expression": 372,
      "argument_list-(:)-octal_integer_literal": 373,
      "argument_list-(:)-parameter_pack_expansion": 374,
      "argument_list-(:)-parenthesized_expression": 375,
      "argument_list-(:)-pointer_expression": 376,
      "argument_list-(:)-preproc_defined": 377,
      "argument_list-(:)-qualified_identifier": 378,
      "argument_list-(:)-raw_string_literal": 379,
      "argument_list-(:)-set": 380,
      "argument_list-(:)-set_comprehension": 381,
      "argument_list-(:)-sizeof_expression": 382,
      "argument_list-(:)-string": 383,
      "argument_list-(:)-string_literal": 384,
      "argument_list-(:)-subscript": 385,
      "argument_list-(:)-subscript_expression": 386,
      "argument_list-(:)-template_function": 387,
      "argument_list-(:)-ternary_expression": 388,
      "argument_list-(:)-this": 389,
      "argument_list-(:)-true": 390,
      "argument_list-(:)-tuple": 391,
      "argument_list-(:)-unary_expression": 392,
      "argument_list-(:)-unary_operator": 393,
      "argument_list-(:)-update_expression": 394,
      "argument_list-(:)-user_defined_literal": 395,
      "arguments-(:)-arguments": 396,
      "arguments-(:)-array": 397,
      "arguments-(:)-arrow_function": 398,
      "arguments-(:)-assignment_expression": 399,
      "arguments-(:)-augmented_assignment_expression": 400,
      "arguments-(:)-await_expression": 401,
      "arguments-(:)-binary_expression": 402,
      "arguments-(:)-call_expression": 403,
      "arguments-(:)-class": 404,
      "arguments-(:)-false": 405,
      "arguments-(:)-function": 406,
      "arguments-(:)-generator_function": 407,
      "arguments-(:)-identifier": 408,
      "arguments-(:)-import": 409,
      "arguments-(:)-jsx_element": 410,
      "arguments-(:)-jsx_fragment": 411,
      "arguments-(:)-jsx_self_closing_element": 412,
      "arguments-(:)-member_expression": 413,
      "arguments-(:)-meta_property": 414,
      "arguments-(:)-new_expression": 415,
      "arguments-(:)-null": 416,
      "arguments-(:)-number": 417,
      "arguments-(:)-object": 418,
      "arguments-(:)-parenthesized_expression": 419,
      "arguments-(:)-regex": 420,
      "arguments-(:)-spread_element": 421,
      "arguments-(:)-string": 422,
      "arguments-(:)-subscript_expression": 423,
      "arguments-(:)-super": 424,
      "arguments-(:)-template_string": 425,
      "arguments-(:)-ternary_expression": 426,
      "arguments-(:)-this": 427,
      "arguments-(:)-true": 428,
      "arguments-(:)-unary_expression": 429,
      "arguments-(:)-undefined": 430,
      "arguments-(:)-update_expression": 431,
      "arguments-(:)-yield_expression": 432,
      "array-(:)-array": 433,
      "array-(:)-arrow_function": 434,
      "array-(:)-assignment_expression": 435,
      "array-(:)-augmented_assignment_expression": 436,
      "array-(:)-await_expression": 437,
      "array-(:)-binary_expression": 438,
      "array-(:)-call_expression": 439,
      "array-(:)-class": 440,
      "array-(:)-false": 441,
      "array-(:)-function": 442,
      "array-(:)-generator_function": 443,
      "array-(:)-identifier": 444,
      "array-(:)-import": 445,
      "array-(:)-jsx_element": 446,
      "array-(:)-jsx_fragment": 447,
      "array-(:)-jsx_self_closing_element": 448,
      "array-(:)-member_expression": 449,
      "array-(:)-meta_property": 450,
      "array-(:)-new_expression": 451,
      "array-(:)-null": 452,
      "array-(:)-number": 453,
      "array-(:)-object": 454,
      "array-(:)-parenthesized_expression": 455,
      "array-(:)-regex": 456,
      "array-(:)-spread_element": 457,
      "array-(:)-string": 458,
      "array-(:)-subscript_expression": 459,
      "array-(:)-super": 460,
      "array-(:)-template_string": 461,
      "array-(:)-ternary_expression": 462,
      "array-(:)-this": 463,
      "array-(:)-true": 464,
      "array-(:)-unary_expression": 465,
      "array-(:)-undefined": 466,
      "array-(:)-update_expression": 467,
      "array-(:)-yield_expression": 468,
      "array_access-(:)-array_access": 469,
      "array_creation_expression-(:)-array_creation_expression": 470,
      "array_creation_expression-(:)-array_type": 471,
      "array_creation_expression-(:)-initializer_expression": 472,
      "array_declarator-(:)-array_declarator": 473,
      "array_declarator-(:)-type_qualifier": 474,
      "array_initializer-(:)-array_access": 475,
      "array_initializer-(:)-array_creation_expression": 476,
      "array_initializer-(:)-array_initializer": 477,
      "array_initializer-(:)-assignment_expression": 478,
      "array_initializer-(:)-binary_expression": 479,
      "array_initializer-(:)-binary_integer_literal": 480,
      "array_initializer-(:)-cast_expression": 481,
      "array_initializer-(:)-character_literal": 482,
      "array_initializer-(:)-class_literal": 483,
      "array_initializer-(:)-decimal_floating_point_literal": 484,
      "array_initializer-(:)-decimal_integer_literal": 485,
      "array_initializer-(:)-false": 486,
      "array_initializer-(:)-field_access": 487,
      "array_initializer-(:)-hex_floating_point_literal": 488,
      "array_initializer-(:)-hex_integer_literal": 489,
      "array_initializer-(:)-identifier": 490,
      "array_initializer-(:)-instanceof_expression": 491,
      "array_initializer-(:)-lambda_expression": 492,
      "array_initializer-(:)-method_invocation": 493,
      "array_initializer-(:)-method_reference": 494,
      "array_initializer-(:)-null_literal": 495,
      "array_initializer-(:)-object_creation_expression": 496,
      "array_initializer-(:)-octal_integer_literal": 497,
      "array_initializer-(:)-parenthesized_expression": 498,
      "array_initializer-(:)-string_literal": 499,
      "array_initializer-(:)-ternary_expression": 500,
      "array_initializer-(:)-this": 501,
      "array_initializer-(:)-true": 502,
      "array_initializer-(:)-unary_expression": 503,
      "array_initializer-(:)-update_expression": 504,
      "array_pattern-(:)-array_pattern": 505,
      "array_pattern-(:)-assignment_pattern": 506,
      "array_pattern-(:)-identifier": 507,
      "array_pattern-(:)-object_pattern": 508,
      "array_pattern-(:)-rest_pattern": 509,
      "array_rank_specifier-(:)-anonymous_method_expression": 510,
      "array_rank_specifier-(:)-anonymous_object_creation_expression": 511,
      "array_rank_specifier-(:)-array_creation_expression": 512,
      "array_rank_specifier-(:)-array_rank_specifier": 513,
      "array_rank_specifier-(:)-as_expression": 514,
      "array_rank_specifier-(:)-assignment_expression": 515,
      "array_rank_specifier-(:)-await_expression": 516,
      "array_rank_specifier-(:)-base_expression": 517,
      "array_rank_specifier-(:)-binary_expression": 518,
      "array_rank_specifier-(:)-boolean_literal": 519,
      "array_rank_specifier-(:)-cast_expression": 520,
      "array_rank_specifier-(:)-character_literal": 521,
      "array_rank_specifier-(:)-checked_expression": 522,
      "array_rank_specifier-(:)-conditional_access_expression": 523,
      "array_rank_specifier-(:)-conditional_expression": 524,
      "array_rank_specifier-(:)-default_expression": 525,
      "array_rank_specifier-(:)-element_access_expression": 526,
      "array_rank_specifier-(:)-element_binding_expression": 527,
      "array_rank_specifier-(:)-generic_name": 528,
      "array_rank_specifier-(:)-global": 529,
      "array_rank_specifier-(:)-identifier": 530,
      "array_rank_specifier-(:)-implicit_array_creation_expression": 531,
      "array_rank_specifier-(:)-implicit_object_creation_expression": 532,
      "array_rank_specifier-(:)-implicit_stack_alloc_array_creation_expression": 533,
      "array_rank_specifier-(:)-initializer_expression": 534,
      "array_rank_specifier-(:)-integer_literal": 535,
      "array_rank_specifier-(:)-interpolated_string_expression": 536,
      "array_rank_specifier-(:)-invocation_expression": 537,
      "array_rank_specifier-(:)-is_expression": 538,
      "array_rank_specifier-(:)-is_pattern_expression": 539,
      "array_rank_specifier-(:)-lambda_expression": 540,
      "array_rank_specifier-(:)-make_ref_expression": 541,
      "array_rank_specifier-(:)-member_access_expression": 542,
      "array_rank_specifier-(:)-null_literal": 543,
      "array_rank_specifier-(:)-object_creation_expression": 544,
      "array_rank_specifier-(:)-parenthesized_expression": 545,
      "array_rank_specifier-(:)-postfix_unary_expression": 546,
      "array_rank_specifier-(:)-prefix_unary_expression": 547,
      "array_rank_specifier-(:)-query_expression": 548,
      "array_rank_specifier-(:)-range_expression": 549,
      "array_rank_specifier-(:)-real_literal": 550,
      "array_rank_specifier-(:)-ref_expression": 551,
      "array_rank_specifier-(:)-ref_type_expression": 552,
      "array_rank_specifier-(:)-ref_value_expression": 553,
      "array_rank_specifier-(:)-size_of_expression": 554,
      "array_rank_specifier-(:)-stack_alloc_array_creation_expression": 555,
      "array_rank_specifier-(:)-string_literal": 556,
      "array_rank_specifier-(:)-switch_expression": 557,
      "array_rank_specifier-(:)-this_expression": 558,
      "array_rank_specifier-(:)-throw_expression": 559,
      "array_rank_specifier-(:)-tuple_expression": 560,
      "array_rank_specifier-(:)-type_of_expression": 561,
      "array_rank_specifier-(:)-verbatim_string_literal": 562,
      "array_rank_specifier-(:)-with_expression": 563,
      "array_type-(:)-array_type": 564,
      "arrow_expression_clause-(:)-anonymous_method_expression": 565,
      "arrow_expression_clause-(:)-anonymous_object_creation_expression": 566,
      "arrow_expression_clause-(:)-array_creation_expression": 567,
      "arrow_expression_clause-(:)-as_expression": 568,
      "arrow_expression_clause-(:)-assignment_expression": 569,
      "arrow_expression_clause-(:)-await_expression": 570,
      "arrow_expression_clause-(:)-base_expression": 571,
      "arrow_expression_clause-(:)-binary_expression": 572,
      "arrow_expression_clause-(:)-boolean_literal": 573,
      "arrow_expression_clause-(:)-cast_expression": 574,
      "arrow_expression_clause-(:)-character_literal": 575,
      "arrow_expression_clause-(:)-checked_expression": 576,
      "arrow_expression_clause-(:)-conditional_access_expression": 577,
      "arrow_expression_clause-(:)-conditional_expression": 578,
      "arrow_expression_clause-(:)-default_expression": 579,
      "arrow_expression_clause-(:)-element_access_expression": 580,
      "arrow_expression_clause-(:)-element_binding_expression": 581,
      "arrow_expression_clause-(:)-generic_name": 582,
      "arrow_expression_clause-(:)-global": 583,
      "arrow_expression_clause-(:)-identifier": 584,
      "arrow_expression_clause-(:)-implicit_array_creation_expression": 585,
      "arrow_expression_clause-(:)-implicit_object_creation_expression": 586,
      "arrow_expression_clause-(:)-implicit_stack_alloc_array_creation_expression": 587,
      "arrow_expression_clause-(:)-initializer_expression": 588,
      "arrow_expression_clause-(:)-integer_literal": 589,
      "arrow_expression_clause-(:)-interpolated_string_expression": 590,
      "arrow_expression_clause-(:)-invocation_expression": 591,
      "arrow_expression_clause-(:)-is_expression": 592,
      "arrow_expression_clause-(:)-is_pattern_expression": 593,
      "arrow_expression_clause-(:)-lambda_expression": 594,
      "arrow_expression_clause-(:)-make_ref_expression": 595,
      "arrow_expression_clause-(:)-member_access_expression": 596,
      "arrow_expression_clause-(:)-null_literal": 597,
      "arrow_expression_clause-(:)-object_creation_expression": 598,
      "arrow_expression_clause-(:)-parenthesized_expression": 599,
      "arrow_expression_clause-(:)-postfix_unary_expression": 600,
      "arrow_expression_clause-(:)-prefix_unary_expression": 601,
      "arrow_expression_clause-(:)-query_expression": 602,
      "arrow_expression_clause-(:)-range_expression": 603,
      "arrow_expression_clause-(:)-real_literal": 604,
      "arrow_expression_clause-(:)-ref_expression": 605,
      "arrow_expression_clause-(:)-ref_type_expression": 606,
      "arrow_expression_clause-(:)-ref_value_expression": 607,
      "arrow_expression_clause-(:)-size_of_expression": 608,
      "arrow_expression_clause-(:)-stack_alloc_array_creation_expression": 609,
      "arrow_expression_clause-(:)-string_literal": 610,
      "arrow_expression_clause-(:)-switch_expression": 611,
      "arrow_expression_clause-(:)-this_expression": 612,
      "arrow_expression_clause-(:)-throw_expression": 613,
      "arrow_expression_clause-(:)-tuple_expression": 614,
      "arrow_expression_clause-(:)-type_of_expression": 615,
      "arrow_expression_clause-(:)-verbatim_string_literal": 616,
      "arrow_expression_clause-(:)-with_expression": 617,
      "arrow_function-(:)-arrow_function": 618,
      "as-(:)-as": 619,
      "as_expression-(:)-as_expression": 620,
      "as_pattern-(:)-as_pattern": 621,
      "as_pattern-(:)-attribute": 622,
      "as_pattern-(:)-await": 623,
      "as_pattern-(:)-binary_operator": 624,
      "as_pattern-(:)-boolean_operator": 625,
      "as_pattern-(:)-call": 626,
      "as_pattern-(:)-comparison_operator": 627,
      "as_pattern-(:)-concatenated_string": 628,
      "as_pattern-(:)-conditional_expression": 629,
      "as_pattern-(:)-dictionary": 630,
      "as_pattern-(:)-dictionary_comprehension": 631,
      "as_pattern-(:)-ellipsis": 632,
      "as_pattern-(:)-false": 633,
      "as_pattern-(:)-float": 634,
      "as_pattern-(:)-generator_expression": 635,
      "as_pattern-(:)-identifier": 636,
      "as_pattern-(:)-integer": 637,
      "as_pattern-(:)-lambda": 638,
      "as_pattern-(:)-list": 639,
      "as_pattern-(:)-list_comprehension": 640,
      "as_pattern-(:)-named_expression": 641,
      "as_pattern-(:)-none": 642,
      "as_pattern-(:)-not_operator": 643,
      "as_pattern-(:)-parenthesized_expression": 644,
      "as_pattern-(:)-set": 645,
      "as_pattern-(:)-set_comprehension": 646,
      "as_pattern-(:)-string": 647,
      "as_pattern-(:)-subscript": 648,
      "as_pattern-(:)-true": 649,
      "as_pattern-(:)-tuple": 650,
      "as_pattern-(:)-unary_operator": 651,
      "ascending-(:)-ascending": 652,
      "assembly-(:)-assembly": 653,
      "assert-(:)-assert": 654,
      "assert_statement-(:)-array_access": 655,
      "assert_statement-(:)-array_creation_expression": 656,
      "assert_statement-(:)-as_pattern": 657,
      "assert_statement-(:)-assignment_expression": 658,
      "assert_statement-(:)-attribute": 659,
      "assert_statement-(:)-await": 660,
      "assert_statement-(:)-binary_expression": 661,
      "assert_statement-(:)-binary_integer_literal": 662,
      "assert_statement-(:)-binary_operator": 663,
      "assert_statement-(:)-boolean_operator": 664,
      "assert_statement-(:)-call": 665,
      "assert_statement-(:)-cast_expression": 666,
      "assert_statement-(:)-character_literal": 667,
      "assert_statement-(:)-class_literal": 668,
      "assert_statement-(:)-comparison_operator": 669,
      "assert_statement-(:)-concatenated_string": 670,
      "assert_statement-(:)-conditional_expression": 671,
      "assert_statement-(:)-decimal_floating_point_literal": 672,
      "assert_statement-(:)-decimal_integer_literal": 673,
      "assert_statement-(:)-dictionary": 674,
      "assert_statement-(:)-dictionary_comprehension": 675,
      "assert_statement-(:)-ellipsis": 676,
      "assert_statement-(:)-false": 677,
      "assert_statement-(:)-field_access": 678,
      "assert_statement-(:)-float": 679,
      "assert_statement-(:)-generator_expression": 680,
      "assert_statement-(:)-hex_floating_point_literal": 681,
      "assert_statement-(:)-hex_integer_literal": 682,
      "assert_statement-(:)-identifier": 683,
      "assert_statement-(:)-instanceof_expression": 684,
      "assert_statement-(:)-integer": 685,
      "assert_statement-(:)-lambda": 686,
      "assert_statement-(:)-lambda_expression": 687,
      "assert_statement-(:)-list": 688,
      "assert_statement-(:)-list_comprehension": 689,
      "assert_statement-(:)-method_invocation": 690,
      "assert_statement-(:)-method_reference": 691,
      "assert_statement-(:)-named_expression": 692,
      "assert_statement-(:)-none": 693,
      "assert_statement-(:)-not_operator": 694,
      "assert_statement-(:)-null_literal": 695,
      "assert_statement-(:)-object_creation_expression": 696,
      "assert_statement-(:)-octal_integer_literal": 697,
      "assert_statement-(:)-parenthesized_expression": 698,
      "assert_statement-(:)-set": 699,
      "assert_statement-(:)-set_comprehension": 700,
      "assert_statement-(:)-string": 701,
      "assert_statement-(:)-string_literal": 702,
      "assert_statement-(:)-subscript": 703,
      "assert_statement-(:)-ternary_expression": 704,
      "assert_statement-(:)-this": 705,
      "assert_statement-(:)-true": 706,
      "assert_statement-(:)-tuple": 707,
      "assert_statement-(:)-unary_expression": 708,
      "assert_statement-(:)-unary_operator": 709,
      "assert_statement-(:)-update_expression": 710,
      "assignment-(:)-assignment": 711,
      "assignment_expression-(:)-assignment_expression": 712,
      "assignment_expression-(:)-assignment_operator": 713,
      "assignment_operator-(:)-assignment_operator": 714,
      "assignment_pattern-(:)-assignment_pattern": 715,
      "asterisk-(:)-asterisk": 716,
      "async-(:)-async": 717,
      "attribute-(:)-argument_list": 718,
      "attribute-(:)-attribute": 719,
      "attribute-(:)-attribute_argument_list": 720,
      "attribute_argument-(:)-anonymous_method_expression": 721,
      "attribute_argument-(:)-anonymous_object_creation_expression": 722,
      "attribute_argument-(:)-array_creation_expression": 723,
      "attribute_argument-(:)-as_expression": 724,
      "attribute_argument-(:)-assignment_expression": 725,
      "attribute_argument-(:)-await_expression": 726,
      "attribute_argument-(:)-base_expression": 727,
      "attribute_argument-(:)-binary_expression": 728,
      "attribute_argument-(:)-boolean_literal": 729,
      "attribute_argument-(:)-cast_expression": 730,
      "attribute_argument-(:)-character_literal": 731,
      "attribute_argument-(:)-checked_expression": 732,
      "attribute_argument-(:)-conditional_access_expression": 733,
      "attribute_argument-(:)-conditional_expression": 734,
      "attribute_argument-(:)-default_expression": 735,
      "attribute_argument-(:)-element_access_expression": 736,
      "attribute_argument-(:)-element_binding_expression": 737,
      "attribute_argument-(:)-generic_name": 738,
      "attribute_argument-(:)-global": 739,
      "attribute_argument-(:)-identifier": 740,
      "attribute_argument-(:)-implicit_array_creation_expression": 741,
      "attribute_argument-(:)-implicit_object_creation_expression": 742,
      "attribute_argument-(:)-implicit_stack_alloc_array_creation_expression": 743,
      "attribute_argument-(:)-initializer_expression": 744,
      "attribute_argument-(:)-integer_literal": 745,
      "attribute_argument-(:)-interpolated_string_expression": 746,
      "attribute_argument-(:)-invocation_expression": 747,
      "attribute_argument-(:)-is_expression": 748,
      "attribute_argument-(:)-is_pattern_expression": 749,
      "attribute_argument-(:)-lambda_expression": 750,
      "attribute_argument-(:)-make_ref_expression": 751,
      "attribute_argument-(:)-member_access_expression": 752,
      "attribute_argument-(:)-name_colon": 753,
      "attribute_argument-(:)-name_equals": 754,
      "attribute_argument-(:)-null_literal": 755,
      "attribute_argument-(:)-object_creation_expression": 756,
      "attribute_argument-(:)-parenthesized_expression": 757,
      "attribute_argument-(:)-postfix_unary_expression": 758,
      "attribute_argument-(:)-prefix_unary_expression": 759,
      "attribute_argument-(:)-query_expression": 760,
      "attribute_argument-(:)-range_expression": 761,
      "attribute_argument-(:)-real_literal": 762,
      "attribute_argument-(:)-ref_expression": 763,
      "attribute_argument-(:)-ref_type_expression": 764,
      "attribute_argument-(:)-ref_value_expression": 765,
      "attribute_argument-(:)-size_of_expression": 766,
      "attribute_argument-(:)-stack_alloc_array_creation_expression": 767,
      "attribute_argument-(:)-string_literal": 768,
      "attribute_argument-(:)-switch_expression": 769,
      "attribute_argument-(:)-this_expression": 770,
      "attribute_argument-(:)-throw_expression": 771,
      "attribute_argument-(:)-tuple_expression": 772,
      "attribute_argument-(:)-type_of_expression": 773,
      "attribute_argument-(:)-verbatim_string_literal": 774,
      "attribute_argument-(:)-with_expression": 775,
      "attribute_argument_list-(:)-attribute_argument": 776,
      "attribute_argument_list-(:)-attribute_argument_list": 777,
      "attribute_declaration-(:)-attribute": 778,
      "attribute_list-(:)-attribute": 779,
      "attribute_list-(:)-attribute_target_specifier": 780,
      "attribute_specifier-(:)-argument_list": 781,
      "attribute_target_specifier-(:)-attribute_target_specifier": 782,
      "attributed_declarator-(:)-array_declarator": 783,
      "attributed_declarator-(:)-attribute_declaration": 784,
      "attributed_declarator-(:)-attributed_declarator": 785,
      "attributed_declarator-(:)-destructor_name": 786,
      "attributed_declarator-(:)-field_identifier": 787,
      "attributed_declarator-(:)-function_declarator": 788,
      "attributed_declarator-(:)-identifier": 789,
      "attributed_declarator-(:)-operator_name": 790,
      "attributed_declarator-(:)-parenthesized_declarator": 791,
      "attributed_declarator-(:)-pointer_declarator": 792,
      "attributed_declarator-(:)-qualified_identifier": 793,
      "attributed_declarator-(:)-reference_declarator": 794,
      "attributed_declarator-(:)-structured_binding_declarator": 795,
      "attributed_declarator-(:)-template_function": 796,
      "attributed_declarator-(:)-template_method": 797,
      "attributed_declarator-(:)-type_identifier": 798,
      "attributed_statement-(:)-attribute_declaration": 799,
      "attributed_statement-(:)-attributed_statement": 800,
      "attributed_statement-(:)-break_statement": 801,
      "attributed_statement-(:)-case_statement": 802,
      "attributed_statement-(:)-co_return_statement": 803,
      "attributed_statement-(:)-co_yield_statement": 804,
      "attributed_statement-(:)-compound_statement": 805,
      "attributed_statement-(:)-continue_statement": 806,
      "attributed_statement-(:)-do_statement": 807,
      "attributed_statement-(:)-expression_statement": 808,
      "attributed_statement-(:)-for_range_loop": 809,
      "attributed_statement-(:)-for_statement": 810,
      "attributed_statement-(:)-goto_statement": 811,
      "attributed_statement-(:)-if_statement": 812,
      "attributed_statement-(:)-labeled_statement": 813,
      "attributed_statement-(:)-return_statement": 814,
      "attributed_statement-(:)-switch_statement": 815,
      "attributed_statement-(:)-throw_statement": 816,
      "attributed_statement-(:)-try_statement": 817,
      "attributed_statement-(:)-while_statement": 818,
      "augmented_assignment-(:)-augmented_assignment": 819,
      "augmented_assignment_expression-(:)-augmented_assignment_expression": 820,
      "auto-(:)-auto": 821,
      "await-(:)-await": 822,
      "await_expression-(:)-anonymous_method_expression": 823,
      "await_expression-(:)-anonymous_object_creation_expression": 824,
      "await_expression-(:)-array": 825,
      "await_expression-(:)-array_creation_expression": 826,
      "await_expression-(:)-arrow_function": 827,
      "await_expression-(:)-as_expression": 828,
      "await_expression-(:)-assignment_expression": 829,
      "await_expression-(:)-augmented_assignment_expression": 830,
      "await_expression-(:)-await_expression": 831,
      "await_expression-(:)-base_expression": 832,
      "await_expression-(:)-binary_expression": 833,
      "await_expression-(:)-boolean_literal": 834,
      "await_expression-(:)-call_expression": 835,
      "await_expression-(:)-cast_expression": 836,
      "await_expression-(:)-character_literal": 837,
      "await_expression-(:)-checked_expression": 838,
      "await_expression-(:)-class": 839,
      "await_expression-(:)-conditional_access_expression": 840,
      "await_expression-(:)-conditional_expression": 841,
      "await_expression-(:)-default_expression": 842,
      "await_expression-(:)-element_access_expression": 843,
      "await_expression-(:)-element_binding_expression": 844,
      "await_expression-(:)-false": 845,
      "await_expression-(:)-function": 846,
      "await_expression-(:)-generator_function": 847,
      "await_expression-(:)-generic_name": 848,
      "await_expression-(:)-global": 849,
      "await_expression-(:)-identifier": 850,
      "await_expression-(:)-implicit_array_creation_expression": 851,
      "await_expression-(:)-implicit_object_creation_expression": 852,
      "await_expression-(:)-implicit_stack_alloc_array_creation_expression": 853,
      "await_expression-(:)-import": 854,
      "await_expression-(:)-initializer_expression": 855,
      "await_expression-(:)-integer_literal": 856,
      "await_expression-(:)-interpolated_string_expression": 857,
      "await_expression-(:)-invocation_expression": 858,
      "await_expression-(:)-is_expression": 859,
      "await_expression-(:)-is_pattern_expression": 860,
      "await_expression-(:)-jsx_element": 861,
      "await_expression-(:)-jsx_fragment": 862,
      "await_expression-(:)-jsx_self_closing_element": 863,
      "await_expression-(:)-lambda_expression": 864,
      "await_expression-(:)-make_ref_expression": 865,
      "await_expression-(:)-member_access_expression": 866,
      "await_expression-(:)-member_expression": 867,
      "await_expression-(:)-meta_property": 868,
      "await_expression-(:)-new_expression": 869,
      "await_expression-(:)-null": 870,
      "await_expression-(:)-null_literal": 871,
      "await_expression-(:)-number": 872,
      "await_expression-(:)-object": 873,
      "await_expression-(:)-object_creation_expression": 874,
      "await_expression-(:)-parenthesized_expression": 875,
      "await_expression-(:)-postfix_unary_expression": 876,
      "await_expression-(:)-prefix_unary_expression": 877,
      "await_expression-(:)-query_expression": 878,
      "await_expression-(:)-range_expression": 879,
      "await_expression-(:)-real_literal": 880,
      "await_expression-(:)-ref_expression": 881,
      "await_expression-(:)-ref_type_expression": 882,
      "await_expression-(:)-ref_value_expression": 883,
      "await_expression-(:)-regex": 884,
      "await_expression-(:)-size_of_expression": 885,
      "await_expression-(:)-stack_alloc_array_creation_expression": 886,
      "await_expression-(:)-string": 887,
      "await_expression-(:)-string_literal": 888,
      "await_expression-(:)-subscript_expression": 889,
      "await_expression-(:)-super": 890,
      "await_expression-(:)-switch_expression": 891,
      "await_expression-(:)-template_string": 892,
      "await_expression-(:)-ternary_expression": 893,
      "await_expression-(:)-this": 894,
      "await_expression-(:)-this_expression": 895,
      "await_expression-(:)-throw_expression": 896,
      "await_expression-(:)-true": 897,
      "await_expression-(:)-tuple_expression": 898,
      "await_expression-(:)-type_of_expression": 899,
      "await_expression-(:)-unary_expression": 900,
      "await_expression-(:)-undefined": 901,
      "await_expression-(:)-update_expression": 902,
      "await_expression-(:)-verbatim_string_literal": 903,
      "await_expression-(:)-with_expression": 904,
      "await_expression-(:)-yield_expression": 905,
      "base-(:)-base": 906,
      "base_class_clause-(:)-qualified_identifier": 907,
      "base_class_clause-(:)-template_type": 908,
      "base_class_clause-(:)-type_identifier": 909,
      "base_expression-(:)-base_expression": 910,
      "base_list-(:)-alias_qualified_name": 911,
      "base_list-(:)-array_type": 912,
      "base_list-(:)-function_pointer_type": 913,
      "base_list-(:)-generic_name": 914,
      "base_list-(:)-global": 915,
      "base_list-(:)-identifier": 916,
      "base_list-(:)-implicit_type": 917,
      "base_list-(:)-nullable_type": 918,
      "base_list-(:)-pointer_type": 919,
      "base_list-(:)-predefined_type": 920,
      "base_list-(:)-primary_constructor_base_type": 921,
      "base_list-(:)-qualified_name": 922,
      "base_list-(:)-tuple_type": 923,
      "binary_expression-(:)-binary_expression": 924,
      "binary_integer_literal-(:)-binary_integer_literal": 925,
      "binary_operator-(:)-binary_operator": 926,
      "bitfield_clause-(:)-assignment_expression": 927,
      "bitfield_clause-(:)-binary_expression": 928,
      "bitfield_clause-(:)-call_expression": 929,
      "bitfield_clause-(:)-cast_expression": 930,
      "bitfield_clause-(:)-char_literal": 931,
      "bitfield_clause-(:)-co_await_expression": 932,
      "bitfield_clause-(:)-compound_literal_expression": 933,
      "bitfield_clause-(:)-concatenated_string": 934,
      "bitfield_clause-(:)-conditional_expression": 935,
      "bitfield_clause-(:)-delete_expression": 936,
      "bitfield_clause-(:)-false": 937,
      "bitfield_clause-(:)-field_expression": 938,
      "bitfield_clause-(:)-identifier": 939,
      "bitfield_clause-(:)-lambda_expression": 940,
      "bitfield_clause-(:)-new_expression": 941,
      "bitfield_clause-(:)-null": 942,
      "bitfield_clause-(:)-nullptr": 943,
      "bitfield_clause-(:)-number_literal": 944,
      "bitfield_clause-(:)-parameter_pack_expansion": 945,
      "bitfield_clause-(:)-parenthesized_expression": 946,
      "bitfield_clause-(:)-pointer_expression": 947,
      "bitfield_clause-(:)-qualified_identifier": 948,
      "bitfield_clause-(:)-raw_string_literal": 949,
      "bitfield_clause-(:)-sizeof_expression": 950,
      "bitfield_clause-(:)-string_literal": 951,
      "bitfield_clause-(:)-subscript_expression": 952,
      "bitfield_clause-(:)-template_function": 953,
      "bitfield_clause-(:)-this": 954,
      "bitfield_clause-(:)-true": 955,
      "bitfield_clause-(:)-unary_expression": 956,
      "bitfield_clause-(:)-update_expression": 957,
      "bitfield_clause-(:)-user_defined_literal": 958,
      "block-(:)-;": 959,
      "block-(:)-annotation_type_declaration": 960,
      "block-(:)-assert_statement": 961,
      "block-(:)-block": 962,
      "block-(:)-break_statement": 963,
      "block-(:)-checked_statement": 964,
      "block-(:)-class_declaration": 965,
      "block-(:)-class_definition": 966,
      "block-(:)-continue_statement": 967,
      "block-(:)-decorated_definition": 968,
      "block-(:)-delete_statement": 969,
      "block-(:)-do_statement": 970,
      "block-(:)-empty_statement": 971,
      "block-(:)-enhanced_for_statement": 972,
      "block-(:)-enum_declaration": 973,
      "block-(:)-exec_statement": 974,
      "block-(:)-expression_statement": 975,
      "block-(:)-fixed_statement": 976,
      "block-(:)-for_each_statement": 977,
      "block-(:)-for_statement": 978,
      "block-(:)-function_definition": 979,
      "block-(:)-future_import_statement": 980,
      "block-(:)-global_statement": 981,
      "block-(:)-goto_statement": 982,
      "block-(:)-if_statement": 983,
